# Import Libraries

In [2]:
import pandas as pd, numpy as np
from google.colab import drive
drive.mount('/content/gdrive')

Mounted at /content/gdrive

# Load datasets

In [6]:
path_1 = 'gdrive/My Drive/DigitalSkola/Dataset/order_details.csv'
path_2 = 'gdrive/My Drive/DigitalSkola/Dataset/order_lists.csv'

details = pd.read_csv(path_1)
lists = pd.read_csv(path_2)

# Show Datasets

In [7]:
details.head()

          order_id  sales  profit  ...  Cost Total_Cost Total_profit
0  AZ-2011-1029887     85      15  ...    70         70           30
1  AZ-2011-1029887     26       7  ...    19         19           14
2   AZ-2011-107716    294     109  ...   185        185          763
3  AZ-2011-1087704     76      11  ...    65         65           33
4  AZ-2011-1087704    252      15  ...   237        237           75

[5 rows x 9 columns]

In [8]:
lists.head()

          order_id  order_date  ...        lon        lat
0  AZ-2011-1029887   7/31/2011  ...  12.373075  51.339696
1   AZ-2011-107716   4/11/2011  ...   5.369780  43.296482
2  AZ-2011-1087704   9/15/2011  ...   8.403653  49.006890
3  AZ-2011-1114253  10/18/2011  ...   9.993682  53.551085
4  AZ-2011-1116129    6/9/2011  ...  11.581981  48.135125

[5 rows x 11 columns]

# Join Table

## Merge method
merge() for combining data on common columns or indices <br>
df = pd.merge(df1, df2, how="left", on=["col1", "col2"])

In [15]:
pd.merge(details, lists, how='right', left_on='order_id', right_on='order_id').shape

(7463, 19)

## Join Method
.join() for combining data on a key column or an index <br>
df = df1.join(df2, how="left", on=["col1", "col2"])

In [13]:
details.join(lists.set_index('order_id'), how='left', on='order_id').shape

(7463, 19)

## Cross Join
In Pandas, there are parameters to perform left, right, inner or outer merge and join on two DataFrames or Series. However there’s no possibility as of now to perform a cross join to merge or join two methods using how="cross" parameter.

In [19]:
# Define a dictionary containing user ID 
dict1 = {'Name': ["Rebecca", "Maryam", "Anita"], 
        'UserID': [1, 2, 3]}  
     
# Define a dictionary containing product ID  
dict2 = {'ProductID': ['P1', 'P2', 'P3', 'P4']}  
   
# Convert the dictionary into DataFrame   
df = pd.DataFrame(dict1)
df1 = pd.DataFrame(dict2)
  
# Now to perform cross join, we will create a key column in both the DataFrames to merge on that key. 
df['key'] = 1
df1['key'] = 1
  
# to obtain the cross join we will merge on the key and drop it. 
result = pd.merge(df, df1, on ='key').drop("key", 1)

result

       Name  UserID ProductID
0   Rebecca       1        P1
1   Rebecca       1        P2
2   Rebecca       1        P3
3   Rebecca       1        P4
4    Maryam       2        P1
5    Maryam       2        P2
6    Maryam       2        P3
7    Maryam       2        P4
8     Anita       3        P1
9     Anita       3        P2
10    Anita       3        P3
11    Anita       3        P4

# Concatenate Dataframe
Concatenate in dataframe is much more flexible than table in database. Because we can choose either concat horizontally (columns) or vertically (rows). <br>
axis = 1 is horizontally (columns) <br>
axis = 0 is vertically (rows) <br>
df = pd.concat([df1, df2], axis=1)

In [28]:
pd.concat([details, lists], axis=0)

             order_id  sales  profit  ...     ship_mode        lon        lat
0     AZ-2011-1029887   85.0    15.0  ...           NaN        NaN        NaN
1     AZ-2011-1029887   26.0     7.0  ...           NaN        NaN        NaN
2      AZ-2011-107716  294.0   109.0  ...           NaN        NaN        NaN
3     AZ-2011-1087704   76.0    11.0  ...           NaN        NaN        NaN
4     AZ-2011-1087704  252.0    15.0  ...           NaN        NaN        NaN
...               ...    ...     ...  ...           ...        ...        ...
4112  BN-2014-9956954    NaN     NaN  ...       Economy  11.619787  44.838124
4113  BN-2014-9978138    NaN     NaN  ...  Economy Plus   6.079758  44.559638
4114  BN-2014-9982544    NaN     NaN  ...       Economy   7.011555  51.455643
4115  BN-2014-9995192    NaN     NaN  ...      Priority  10.062852  52.617596
4116  BN-2014-9998478    NaN     NaN  ...       Economy   4.768323  51.571915

[11580 rows x 19 columns]

# Append Dataframe
Append rows of other dataframe to the end of initial one. In order to append dataframe in the same column, column’s name between two tables must be the same. If there is any column name discrepancy, new column will be created. <br>
df = df1.append(df2)

In [29]:
details.append(lists)

             order_id  sales  profit  ...     ship_mode        lon        lat
0     AZ-2011-1029887   85.0    15.0  ...           NaN        NaN        NaN
1     AZ-2011-1029887   26.0     7.0  ...           NaN        NaN        NaN
2      AZ-2011-107716  294.0   109.0  ...           NaN        NaN        NaN
3     AZ-2011-1087704   76.0    11.0  ...           NaN        NaN        NaN
4     AZ-2011-1087704  252.0    15.0  ...           NaN        NaN        NaN
...               ...    ...     ...  ...           ...        ...        ...
4112  BN-2014-9956954    NaN     NaN  ...       Economy  11.619787  44.838124
4113  BN-2014-9978138    NaN     NaN  ...  Economy Plus   6.079758  44.559638
4114  BN-2014-9982544    NaN     NaN  ...       Economy   7.011555  51.455643
4115  BN-2014-9995192    NaN     NaN  ...      Priority  10.062852  52.617596
4116  BN-2014-9998478    NaN     NaN  ...       Economy   4.768323  51.571915

[11580 rows x 19 columns]

# Indexing in DF
When you join, concat, or append dataframes, the index will be repetitive. That's why it needs to be reset. <br>
df.reset_index() <br>
Sometimes we need to change the  column as an index. here's how: <br>
df.set_index('column', inplace=True)

# Pivoting Table
Create a spreadsheet-style pivot table as a dataframe. The levels in the pivot table will be stored in MultiIndex objects (hierarchical indexes) on the index and columns of the result dataframe. <br>
table = pd.pivot_table(df, values=['D', 'E'], index=['A', 'C'], aggfunc={'D': np.mean, 'E': np.mean}, fill_value=0)

# Melting Table
Pandas.melt() unpivots a dataframe from wide format to long format. melt() function is useful to massage a dataframe into a format where one or more columns are identifier variables, while all other columns, considered measured variables, are unpivoted to the row axis, leaving just two non-identifier columns, variable and value.

In [22]:
d1 = {"Name": ["Adi", "Lisa", "Budi"],
      "ID": [1, 2, 3],
      "Role": ["CEO", "Editor", "Author"]}
df = pd.DataFrame(d1)
df

   Name  ID    Role
0   Adi   1     CEO
1  Lisa   2  Editor
2  Budi   3  Author

In [23]:
df_melted = pd.melt(df, id_vars=["ID"], value_vars=["Name", "Role"])
df_melted

   ID variable   value
0   1     Name     Adi
1   2     Name    Lisa
2   3     Name    Budi
3   1     Role     CEO
4   2     Role  Editor
5   3     Role  Author

# Lambda functions
A lambda function is a small anonymous function. A lambda function can take any number of arguments, but can only have one expression.

In [26]:
x = lambda a : a + 10
print(x(5))

15

In [ ]:
y = lambda x

# Lambda in Pandas
Applying lambda function to single column using Dataframe.assign()

In [24]:
# creating and initializing a list 
values= [['Rohan',455],['Elvish',250],['Deepak',495], 
         ['Soni',400],['Radhika',350],['Vansh',450]]  
  
# creating a pandas dataframe 
df = pd.DataFrame(values,columns=['Name','Total_Marks']) 
df

      Name  Total_Marks
0    Rohan          455
1   Elvish          250
2   Deepak          495
3     Soni          400
4  Radhika          350
5    Vansh          450

In [25]:
# Applying lambda function to find percentage of 'Total_Marks' column using df.assign() 
df = df.assign(Percentage = lambda x: (x['Total_Marks'] /500 * 100))
df

      Name  Total_Marks  Percentage
0    Rohan          455        91.0
1   Elvish          250        50.0
2   Deepak          495        99.0
3     Soni          400        80.0
4  Radhika          350        70.0
5    Vansh          450        90.0